import React from 'react';
import { Link } from 'react-router-dom';
import { useSelector } from 'react-redux';
import CartItem from '../Components/CartItem/CartItem';
import './Cart.scss';
const Cart = () => {
  const { totalPrice, totalCount, items } = useSelector(({ cart }) => cart);

  const addedPizzas = Object.keys(items).map((key) => {
    return items[key].items[0];
  });
  return (
    <div className="Cart">
      <div className="cartContainer">
        <div className="cartHeader">
          <div className="cartTitle">
            <svg
              width="28px"
              height="25px"
              viewBox="0 0 50 50"
              fill="none"
              xmlns="http://www.w3.org/2000/svg">
              <path
                d="M48.6259 9.48715C47.699 8.42819 46.3776 7.84492 44.9055 7.84492H9.31664L8.95844 5.15938C8.57239 2.26631 6.55823 0 4.37279 0H1.75781C0.948715 0 0.292969 0.655746 0.292969 1.46484C0.292969 2.27394 0.948715 2.92969 1.75781 2.92969H4.37279C4.84276 2.92969 5.83801 3.92342 6.05431 5.54657L10.2474 36.9957C10.4321 38.382 11.1443 39.6797 12.2528 40.6502C13.0749 41.37 14.0465 41.8488 15.0642 42.049C14.6496 42.8116 14.4138 43.6852 14.4138 44.6125C14.4138 47.5834 16.8308 50 19.8013 50C22.7718 50 25.1888 47.5834 25.1888 44.6125C25.1888 43.7275 24.9729 42.8925 24.593 42.1551H32.2689C31.889 42.8925 31.673 43.7275 31.673 44.6125C31.673 47.5834 34.09 50 37.0605 50C40.0311 50 42.448 47.5834 42.448 44.6125C42.448 43.7275 42.2321 42.8925 41.8522 42.1551H45.6902C46.4989 42.1551 47.155 41.4989 47.155 40.6902C47.155 39.8811 46.4989 39.2254 45.6902 39.2254H16.1404C14.7091 39.2254 13.3404 38.0268 13.1512 36.6081L12.8448 34.3098H24.2458C24.2462 34.3098 24.2466 34.3102 24.247 34.3102C24.2474 34.3102 24.2477 34.3098 24.2485 34.3098H33.6594C33.6597 34.3098 33.6601 34.3102 33.6609 34.3102C33.6613 34.3102 33.6613 34.3098 33.6617 34.3098H41.7675C43.166 34.3098 44.5465 33.7753 45.6551 32.8053C46.7636 31.8348 47.4758 30.5367 47.6604 29.1504L49.7616 13.3919C49.9561 11.9328 49.5529 10.5461 48.6259 9.48715V9.48715ZM22.2591 44.6125C22.2591 45.9679 21.1567 47.0703 19.8013 47.0703C18.4464 47.0703 17.3435 45.9679 17.3435 44.6125C17.3435 43.2575 18.4464 42.1551 19.8013 42.1551C21.1567 42.1551 22.2591 43.2575 22.2591 44.6125V44.6125ZM39.5184 44.6125C39.5184 45.9679 38.4159 47.0703 37.0605 47.0703C35.7052 47.0703 34.6027 45.9679 34.6027 44.6125C34.6027 43.2575 35.7052 42.1551 37.0605 42.1551C38.4159 42.1551 39.5184 43.2575 39.5184 44.6125V44.6125ZM46.4214 11.417C46.7842 11.8313 46.9391 12.3947 46.8575 13.0043L45.9766 19.6125H36.0096L36.5986 10.7746H44.9055C45.5208 10.7746 46.059 11.0027 46.4214 11.417V11.417ZM25.6187 31.3801L25.0294 22.5422H32.8781L32.2887 31.3801H25.6187ZM24.8341 19.6125L24.2451 10.7746H33.6624L33.0734 19.6125H24.8341ZM21.3089 10.7746L21.8979 19.6125H10.8852L9.70688 10.7746H21.3089ZM11.2759 22.5422H22.0932L22.6826 31.3801H12.4542L11.2759 22.5422ZM41.7675 31.3801H35.2249L35.8143 22.5422H45.586L44.7567 28.7632C44.5675 30.1819 43.1984 31.3801 41.7675 31.3801Z"
                fill="#000"
              />
            </svg>
            <h2>Корзина</h2>
          </div>
          <div className="cartClearBtn">
            <svg
              width="20"
              height="20"
              viewBox="0 0 20 20"
              fill="none"
              xmlns="http://www.w3.org/2000/svg">
              <path
                d="M2.5 5H4.16667H17.5"
                stroke="#B6B6B6"
                strokeWidth="1.2"
                strokeLinecap="round"
                strokeLinejoin="round"
              />
              <path
                d="M6.66663 5.00001V3.33334C6.66663 2.89131 6.84222 2.46739 7.15478 2.15483C7.46734 1.84227 7.89127 1.66667 8.33329 1.66667H11.6666C12.1087 1.66667 12.5326 1.84227 12.8451 2.15483C13.1577 2.46739 13.3333 2.89131 13.3333 3.33334V5.00001M15.8333 5.00001V16.6667C15.8333 17.1087 15.6577 17.5326 15.3451 17.8452C15.0326 18.1577 14.6087 18.3333 14.1666 18.3333H5.83329C5.39127 18.3333 4.96734 18.1577 4.65478 17.8452C4.34222 17.5326 4.16663 17.1087 4.16663 16.6667V5.00001H15.8333Z"
                stroke="#B6B6B6"
                strokeWidth="1.2"
                strokeLinecap="round"
                strokeLinejoin="round"
              />
              <path
                d="M8.33337 9.16667V14.1667"
                stroke="#B6B6B6"
                strokeWidth="1.2"
                strokeLinecap="round"
                strokeLinejoin="round"
              />
              <path
                d="M11.6666 9.16667V14.1667"
                stroke="#B6B6B6"
                strokeWidth="1.2"
                strokeLinecap="round"
                strokeLinejoin="round"
              />
            </svg>
            <p>Очитстить корзину</p>
          </div>
        </div>
        <div className="orderList">
          {addedPizzas.map((obj) => (
            <CartItem
              name={obj.name}
              type={obj.type}
              size={obj.size}
              totalPrice={items[obj.id].totalPrice}
              totalCount={items[obj.id].items.length}
            />
          ))}
        </div>
        <div className="orderInfo">
          <p>
            Всего пицц: <b>{totalCount} шт.</b>
          </p>
          <p>
            Сумма заказа: <b>{totalPrice}₴</b>
          </p>
        </div>
        <div className="orderBtn">
          <div className="orderBackBtn">
            <svg
              width="8"
              height="14"
              viewBox="0 0 8 14"
              fill="none"
              xmlns="http://www.w3.org/2000/svg">
              <path
                d="M7 13L1 6.93015L6.86175 1"
                stroke="#D3D3D3"
                strokeWidth="1.5"
                strokeLinecap="round"
                strokeLinejoin="round"
              />
            </svg>
            <Link to="/"> Вернуться назад</Link>
          </div>
          <div className="orderCheckoutBtn">Оплатить сейчас</div>
        </div>
      </div>
    </div>
  );
};

export default Cart;
